import re

def get_user_input():
    """
    Запитує у користувача введення тексту, символу, розмірів ASCII-арту, кольору та вирівнювання для генерації ASCII-арту.

    Повертає:
    - text (str): Текст, який буде використано для створення ASCII-арту (лише латиниця).
    - symbol (str): Символ для заповнення ASCII-арту.
    - width (int): Ширина ASCII-арту.
    - height (int): Висота ASCII-арту.
    - color_choice (str): Обраний колір для ASCII-арту.
    - alignment (str): Обране вирівнювання для ASCII-арту ('left', 'center', 'right').

    Процес:
    1. Користувач вводить текст, символ, ширину та висоту для створення ASCII-арту.
    2. Програма перевіряє, чи написано текст латиницею. Якщо текст написано кирилицею, програма запитує ввести текст латиницею.
    3. Користувач вибирає символ для заповнення, розміри арту (ширина та висота), колір і вирівнювання.
    4. Програма перевіряє, чи введене правильне вирівнювання.
    
    Якщо все введено правильно, програма повертає введені значення для подальшої генерації ASCII-арту.
    """
    while True:
        # Запит на введення тексту
        text = input("Введіть слово або фразу для ASCII-арту (латиницею): ").strip()
        
        # Перевірка, чи текст не містить кирилиці
        if re.search('[А-Яа-я]', text):
            print("Будь ласка, напишіть на англійській мові.")
            continue  

        # Запит на введення символу для заповнення
        symbol = input("Введіть символ для заповнення (наприклад, '@', '#', '*'): ").strip()
        
        # Запит на введення ширини та висоти ASCII-арту
        width = int(input("Введіть ширину ASCII-арту: "))
        height = int(input("Введіть висоту ASCII-арту: "))
        
        # Запит на вибір кольору
        print("Доступні кольори: black_and_white, gray, red, green, yellow, blue, magenta, cyan, white")
        color_choice = input("Виберіть колір: ").strip()

        # Запит на вибір вирівнювання
        print("Виберіть вирівнювання (left, center, right):")
        alignment = input().strip().lower()
        
        # Перевірка на допустимі значення вирівнювання
        if alignment not in ['left', 'center', 'right']:
            print("Недійсне вирівнювання. Будь ласка, виберіть з 'left', 'center', 'right'.")
            continue

        # Повертаємо всі введені значення
        return text, symbol, width, height, color_choice, alignment
