import pyfiglet
import re

def get_text_input():
    """
    Отримує текст від користувача для створення ASCII-арту.

    Опис:
        Функція приймає введення від користувача. Якщо введено текст українською мовою, 
        буде виведено попередження, і користувача буде запитано ввести текст англійською мовою.
        Функція повертає введений текст після того, як він буде перевірений.

    Повертає:
        str: Текст для створення ASCII-арту.

    Викидає:
        Викидає ValueError, якщо введено текст не англійською мовою.
    """
    while True:
        text = input("Введіть слово або фразу для ASCII-арту: ")
        if re.search('[а-яА-ЯёЁіІїЇєЄ]', text):
            print("Будь ласка, введіть текст англійською мовою.")
        else:
            return text

def get_font_choice():
    """
    Запитує у користувача вибір шрифту для створення ASCII-арту.

    Опис:
        Функція пропонує користувачу вибрати шрифт для ASCII-арту з попередньо визначеного списку. 
        Якщо введено неправильний шрифт, використовується стандартний шрифт за замовчуванням.

    Повертає:
        str: Обраний шрифт для ASCII-арту.

    Викидає:
        Викидає ValueError, якщо користувач не вибирає правильний шрифт.
    """
    available_fonts = ['standard', 'slant', 'block', 'bubble', 'big', 'electronic']
    print("Доступні шрифти:", ", ".join(available_fonts))
    font = input("Виберіть шрифт з наведеного вище списку: ")
    if font not in available_fonts:
        print("Обраний шрифт недоступний. Використовується шрифт за замовчуванням: 'standard'.")
        return 'standard'
    return font

def get_color_choice():
    """
    Запитує у користувача вибір кольору для ASCII-арту.

    Опис:
        Функція дозволяє користувачеві вибрати один з доступних кольорів для ASCII-арту. 
        Якщо введений неправильний колір, використовується колір за замовчуванням (білий).

    Повертає:
        str: Обраний колір для ASCII-арту.

    Викидає:
        Викидає ValueError, якщо вибраний колір неправильний.
    """
    colors = ['red', 'green', 'blue', 'white']
    print("Доступні кольори:", ", ".join(colors))
    color = input("Виберіть колір: ").lower()
    if color not in colors:
        print("Невірний колір. Використовується колір за замовчуванням: 'white'.")
        return 'white'
    return color

def get_dimensions():
    """
    Запитує у користувача розміри (ширину та висоту) для створення ASCII-арту.

    Опис:
        Функція запитує у користувача ширину та висоту для ASCII-арту. Вводяться ці параметри як цілі числа.
        Функція перевіряє, чи значення більші за нуль.

    Повертає:
        tuple: Ширина та висота ASCII-арту у вигляді кортежу (width, height).

    Викидає:
        ValueError: Якщо введені значення ширини чи висоти менші або рівні нулю.
    """
    width = int(input("Введіть ширину ASCII-арту (число більше 0): "))
    height = int(input("Введіть висоту ASCII-арту (число більше 0): "))
    return width, height

def get_symbol_choice():
    """
    Запитує у користувача символ для заповнення ASCII-арту.

    Опис:
        Функція пропонує користувачу ввести символ для заповнення ASCII-арту. 
        Це може бути будь-який символ на вибір користувача.

    Повертає:
        str: Символ для заповнення ASCII-арту.

    Викидає:
        ValueError: Якщо символ не є дійсним (наприклад, порожній рядок).
    """
    symbol = input("Введіть символ для заповнення (наприклад, '@', '#', '*'): ")
    return symbol
